<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<script src="https://code.jquery.com/jquery-3.6.0.js"></script>
<meta charset="UTF-8">
<title>Scroll</title>
<style>
	div {
		position:fixed;
		top:200px;
		width:125px;
		height:25px;
	}
	#aa {
		left:100px;
		background:lightsalmon;
	}
	#bb {
		left:400px;
		background:tomato;
	}
</style>
<script>
	$(function(){
		$(window).scroll(function(){
			//console.log("yo!");
			var sc = $(window).scrollTop();
			$('#aa').text(sc);
		});
		
		$('#bb').click(function(){
			$(window).scrollTop(0);
		});
	});
</script>
</head>
<body>
	
	<div id="aa"></div>
	<div id="bb"></div>
	<hr>
	2022년 러시아의 우크라이나 침공 경과의 7월 목록을 정리한 문서이다.

러시아 측과 우크라이나 측 양쪽 모두 거짓, 과장, 오해를 담은 정보들이 여러 매체와 SNS 상에서 난무하고 있다. 이는 교전국 간에 벌어지고 있는 정보전의 부산물 혹은 공포에 떠는 시민에 의한 잘못된 정보일 가능성이 있다.# 따라서 여기 인용된 정보도 실제 상황과는 상당히 다른 내용일 가능성이 높기 때문에 참고용으로만 사용해야 한다. 이 문서에 올라온 정보 중에 출처 표기가 없는 것도 있으며 이런 것은 가짜뉴스일 수도 있다. 특히 AP통신이나 CNN 등 주요 언론이나 공식 기관의 SNS 및 트위터발 정보가 아닌 경우 쉽게 사실로 믿기 어려우며, 여러 근거와 교차검증으로 확인된 사안들([검증된 사실]이 부착된 서술)을 제외하면 신뢰성을 담보하기 어렵다.심지어 AP통신, CNN도 잘못된 정보가 종종 확인되므로 꾸준한 교차검증이 필요하다. 실제로 즈미이니 섬 전투처럼 전 세계 커뮤니티에 퍼진 뒤 며칠 뒤에 사실은 항복해서 살아있다는 식으로 정정되는 해프닝도 발생했다.

특히 BBC, CNN, DW 등 서방 언론을 사칭한 조작된 친러 성향 게시물이 러시아와 우크라이나 간 오보 전쟁을 부추기고 있다. 러시아는 가짜뉴스를 살포해 다양한 국제 언론 매체의 신용을 떨어뜨리고 있다. 러시아가 2월 24일 우크라이나를 침공한 이후 가짜 뉴스가 성행하고 있으며 BBC, CNN, 그리고 다른 뉴스 매체에서 온 것처럼 가장한 가짜 비디오, 보고서, 트윗이 소셜 미디어 플랫폼에 올라왔고, 일부는 심지어 많이 공유되었다. 이것의 배후에는 러시아가 있으며 러시아의 허위사실 공표 전쟁을 방조하는 것이 주된 목적인 것으로 보인다고 한다. 그들의 두 번째 목표는 (서방) 언론 매체의 신용을 떨어뜨리는 것으로 보인다고 한다.##

실시간 전황 지도 파악은 위키백과의 svg 파일에 상세하고 빠르게 업데이트되고 있고, 전선 변화를 gif로 나타낸 것도 있는데, 누구나 편집할 수 있다는 위키백과 특성상 교차검증이 필요하며 이 문서 또한 마찬가지다.
	
	우크라이나군이 즈미이니 섬에 남아있는 병력을 구하려던 러시아군 수송 헬리콥터를 격추시켰다.#
러시아군은 리시찬스크 부근에서 '부분적 성공'을 거두었다. 우크라이나군에 따르면 러시아군이 리시찬스크 정유공장을 습격해 공장 북부를 장악했다. 도시는 끊임없이 포격을 받고 있다.#
우크라이나는 6월 30일부터 EU에 전기를 수출하기 시작한다. 우크라이나 전력은 루마니아를 통해 수출되지만 나중에 슬로바키아와 헝가리를 추가하여 경로를 확장할 예정이다. 현재 총 수출 용량은 하루 100메가와트로 추후 800메가와트까지 늘릴 계획이다. 이는 우크라이나의 수익 증대에 도움이 될 것이다.#
UN은 우크라이나 국내 피난민들의 거의 절반이 고향으로 돌아온다고 밝혔다. 국제이주기구(IOC)는 우크라이나에서 550만 명 이상이 고향으로 돌아왔지만 620만 명이 국내 피난민으로 남아 있다고 밝혔다. 한편 이들 중 15%는 고향의 집이 파괴되었다고 한다.#
프랑스는 추가적인 6문의 CAESAR 곡사포와 상당수의 기갑장비를 포함하여 우크라이나가 스스로를 방어하는 데 필요한 장비를 신속하게 제공할 것이라고 에마뉘엘 마크롱 프랑스 대통령이 밝혔다. 프랑스, 동맹국 및 유럽 파트너가 거기에 있고 앞으로도 있을 것이라고 그는 공식 트위터에서 밝혔다.#
조 바이든 미국 대통령은 마드리드에서 열린 NATO 정상회의에서 "미국의 주도로 50개국 이상이 우크라이나에 무기 공급을 약속했다."고 말했다. 바이든 대통령에 따르면, "우리는 약 140,000개의 대전차 무기, 600대 이상의 전차, 거의 500문의 포병 장비, 600,000발 이상의 포탄, 고성능 다연장로켓, 대함 무기체계 및 방공 무기체계에 대해 이야기하고 있다."라고 한다. 또 바이든 미국 대통령은 "푸틴은 NATO의 핀란드화(Finland-ization)를 원했지만, 핀란드의 NATO화(NATO-ization)를 얻었다."고 비꼬았다.#### 미 국방부 역시 전차 600대, 야포 500문, 포탄 60만발 지원을 공식 인증했다.#
바이든 대통령은 목요일 미국과 동맹국들이 우크라이나가 러시아와의 전쟁에서 승리하기 위해 "시간이 얼마가 걸리든" 지원을 제공할 것이라고 말했다. 바이든 대통령은 목요일 기자들에게 전쟁이 "더 늦기 보다는 더 빨리 끝나기를 바란다."고 말했지만, 그렇게 되기 위해서는 우크라이나 국민들이 강력한 위치에 있어야 한다는 것을 인정했다. 바이든 대통령은 미국이 우크라이나의 전투를 더욱 지원하기 위해 8억 달러의 추가 자금을 제공할 것이라고 말했다.#
쥐스탱 트뤼도 캐나다 총리는 39대의 ACSV 장륜 장갑차 등을 포함한 군사 지원을 우크라이나에 제공하기로 했다고 발표했다.#
미 국방부는 우크라이나를 위해 개발 및 생산할 수 있는 혁신적인 새 무기에 대해 800개 기업의 1,300개 제안을 검토하고 있다고 국방부 관리가 말했다. 펜타곤은 앞으로 몇 주 안에 추진하고자 하는 제안에 대한 결정을 내릴 것이다.##
유럽연합(EU)과 러시아가 러시아 본토와 칼리닌그라드 사이의 물자 이동에 관한 계획을 마련할 필요가 있다는 데 합의했다고 폴란드 총리가 목요일 밝혔다. 유럽 관리들이 지금까지 철강 등 공산품을 강타한 칼리닌그라드에 대한 제재를 면제하는 방안을 협의하고 있다며, EU 회원국 리투아니아가 유보를 철회할 경우 7월 초 타결될 수 있는 토대를 마련했다. 마테우시 모라비에츠키 폴란드 총리는 기자 회견에서 "솔직히 말해서 칼리닌그라드는 러시아의 아주 작은 부분이기 때문에, 양측은 사실상의 제재의 이행을 위반하지 않는 계획에 합의할 가치가 있다고 결론내렸다."고 말했다.#
[검증 필요] 러시아군 치하 마리우폴에서는 일전의 공방전들로 상수도 공급이 마비된 상태인데, 러시아가 행정이 복구되었다며 살수차로 곳곳을 물청소하고 있어 주민들의 불만이 크다.#
스페인 마드리드 NATO 정상회의에서 에스토니아와 라트비아 국방장관이 중거리 방공 시스템 공동 구매 의향서에 서명했다. 다른 동맹국 역시 또한 원하면 이 공동 구매에 참여할 수 있다는 듯 하다. 어떤 물품을 구매하는지에 대해서는 아직 확정된 발표가 없다.#
우크라이나는 14억 달러 상환 및 이자 지급을 위한 부채 구조 조정을 고려하고 있다. 블룸버그는 이 문제에 정통한 3명의 소식통을 인용해 여러 가지 옵션을 고려하고 있지만 늦여름이 되어야 결정이 내려질 것이라고 전했다.#
우크라이나군 올렉시 흐로모우 준장은 러시아가 우크라이나를 공격하는데 사용한 미사일의 50% 이상이 구소련 시절의 재고인 부정확한 물건이라고 말했다. 공격 빈도는 지난 2주 동안 두 배 이상 증가했으며 202발의 미사일이 우크라이나 영토에 발사되었다. 러시아의 목표는 군사 시설, 핵심 기반 시설 및 산업, 운송 네트워크이며, 이 과정에서 정밀도가 떨어지는 공격으로 인해 목표와 관계없는 곳을 타격하는 일이 많아 민간인들이 상당한 피해를 입고 있다고 한다.#
헤르손 지역에서는 러시아군이 주거지역에 계속 지뢰를 심고 있다고 한다.#
루한스크 주의 스타하노프(우크라이나에서는 2016년 카디이우카로 개칭)에서 폭발이 일어났는데, 이 도시는 현재 루한스크 반군 영역에 속해있다.#
헤르손 전선에서 우크라이나군은 여전히 세 방향에서 계속 진격하고 있다. 점령지가 계속 탈환되는 중이며 며칠 안에 공식적인 발표가 있을 것이라고 한다. 러시아군은 강 건너 교두보에서 우크라이나군을 밀어내려 시도하고 있다.#
리시찬스크를 둘러싼 포위망은 이제 며칠 안에 닫힐 것이며, 정유공장의 최후 방어벽이 무너지면 이는 불가피할 것이라고 한다.#
슬로뱐스크 북쪽에서 전투가 계속되고 있으며 러시아군의 또 다른 공세가 격퇴되었다. 리시찬스크의 상황은 우크라이나군에게 어렵다. 바흐무트에서는 러시아군의 모든 공격이 격퇴되었다.#
ISW는 에네르호다르의 러시아 당국이 주민들이 대량의 흐리우냐를 인출하도록 유도하기 위해 비현금 결제 시스템이 더 이상 흐리우냐 결제를 하지 않을 것이라는 가짜 정보를 퍼뜨리고 있는 것으로 알려졌다고 보고했다.#
우크라이나에서 3명의 보안관이 점령된 베르댠스크에서 러시아군이 우크라이나 참전용사를 식별하도록 도운 혐의로 기소되었다. 국가수사국(State Bureau of Investigation)에 따르면 이들은 러시아군과 협력하고 있었으며 차량과 무기를 인계했다. 그들은 또한 도시에 거주하는 우크라이나 참전용사들의 주소를 러시아군에 제공한 혐의도 받고 있다.#
러시아가 미콜라이우의 주거용 건물을 공습한 이래 발견된 사망자가 8명으로 증가했다. 미콜라이우 주에 있는 우크라이나 국가 비상 대책기관은 6월 30일 말에 구조대원이 무너진 계단 아래에서 남성의 시신을 발견했다고 보고했다. 지난 6월 29일 오전 우크라이나 남부 미콜라이우의 한 아파트에 러시아가 미사일을 발사해 총 8명이 숨지고 6명이 부상당했다.#
오데사 주에 대한 러시아의 미사일 공격으로 10명이 사망하고 7명이 부상당했다. 오데사 주의 세르히 브라추크 주지사는 7월 1일 초 러시아의 미사일이 9층 높이의 고층 건물을 공격했고 또 다른 미사일이 빌호로드드니스트로우스키 지구의 레저 단지를 목표로 삼았다고 보고했다. 현지 시각 오전 2시 30분 기준 이 고층 건물에서 발생한 공격으로 10명이 사망하고 어린이 3명을 포함해 7명이 부상당했다. 현장에서는 구조 작업이 계속되고 있다.# 두 공습을 합쳐 총 17명의 사망자와 31명의 부상자가 발생했다.#
더 가디언 보도에 따르면 미국은 러시아 재벌 술레이만 케리모프(Suleyman Kerimov)와 연계된 현지 회사를 차단했다. 미 재무부는 6월 30일 10억 달러가 넘는 델라웨어 소재 기업 헤리티지 트러스트(Heritage Trust)를 차단했다. 이 회사는 러시아 독재자 블라디미르 푸틴과 관련이 있는 러시아 과두 정치인인 술레이만 케리모프와 연결되어 있다. 재무부 관리들은 이 자금이 유럽에 설립된 은밀한 회사와 은밀한 재단을 통해 미국으로 돈을 가져오는 데 사용되었다고 말했다.#
우크라이나군이 최근 탈환한 포톰키네에서 러시아군의 BRM-1K(BMP-1의 정찰용 개량형) 1대를 파괴하고 BMP-2 1대를 노획했다.# T-72B3 전차 1대도 파괴한 것이 뒤늦게 확인됐다.#
노르웨이에서 공급되는 가스를 덴마크를 거쳐 폴란드로 운반할 파이프라인의 주요 구간은 예정보다 30일 이상 빨리 사용할 수 있는 것으로 알려졌다. 폴란드의 가스 인프라 운영회사인 가즈시스템(Gaz-System)은 191km의 파이프라인 구간(가장 긴 육상 요소)이 필요한 테스트를 통과했으며 가스화 준비가 완료됐다고 발표했다. 폴란드 정부는 올해 말 가즈프롬과 체결한 계약이 만료될 때까지 가즈프롬과의 계약을 갱신하지 않는 것을 포함해 오랫동안 러시아의 가스 사용을 금지하는 계획을 세웠다. 이러한 계획들은 우크라이나 침공으로 가속화되었고 폴란드는 올해 모든 러시아 에너지 수입을 중단하겠다는 의사를 밝혔다. 이후 폴란드 정부가 루블화 지불 전환을 거부하자 가즈프롬은 폴란드에 대한 가스 수출을 중단했다. 노르웨이로부터의 새로운 파이프라인뿐만 아니라, 폴란드 정부는 카타르와 미국에서 액화 천연가스의 수입을 증가시키기 위해 노력해왔고, 최근 그단스크에 들어올 새로운 부유식 LNG 터미널이 당초 계획보다 두 배 더 커질 것이라고 발표했다. 향후 폴란드는 이 발틱 파이프라인을 크로아티아까지 연장할 생각이다.#
러시아가 우크라이나 전쟁에 참전할 군인들을 모집하기 위한 움직임을 강화하기 시작했다. 러시아에선 이제 40세 이상도 모집에 참여할 수 있고 예비역들은 소환령을 받기 시작하고 있다. 이는 정예병 손실에 따른 군대 경험 있는 숙련병을 모집하기 위해서이다. 총동원령의 경우 현재 전쟁에 대한 수동적인 지지자들이 빠르게 적극적인 반대자로 돌아설 수 있고 러시아 지도부는 대중의 불만을 조장하는 것을 경계하고 있어 정치적 이유로 실행되고 있지 않다. 현재 러시아군의 병력은 드니프로, 오데사 또는 키이우의 도시들을 점령하기에 충분하지 않다. 그러나 만약 러시아가 궁지에 몰린다면, 총동원령을 선언할 수도 있다고 한다.#
유럽연합의 칼리닌그라드 봉쇄완화 정책이 일부 회원국의 반대로 완전히 무산되었다. 특히 리투아니아는 칼리닌그라드를 통과하는 러시아 상품에 대한 EU 제재를 시행하지 말라는 브뤼셀과 베를린의 압력에도 불구하고 꿈쩍도 하지 않고 EU와 이전에 합의한 대로 운송에 새로운 제재를 부과할 계획이다.#
세르게이 라브로프 러시아 외무장관이 서방과 러시아 사이에 이미 '철의 장막'이 드리워지고 있다고 말했다고 가디언 등이 30일(현지시간) 보도했다. 라브로프 장관은 이날 벨라루스 수도 민스크에서 열린 울라지미르 마키에이 벨라루스 외무장관과의 회담 후 공동기자회견을 가졌는데, "서방이 철의 장막의 기초를 세우고 있다."는 마키에이 장관의 발언에 동조하면서 "철의 장막은 근본적으로 이미 드리워지기 시작했다."며 "그 과정은 이미 시작됐다."고 말했다. 그는 우크라이나 크림 반도를 병합한 2014년 이후 러시아와 EU 사이에는 어떤 관계도 없었다고 덧붙였다. 라브로프 장관은 특히 "다만 그들(서방)은 조심스럽게 행동해야 할 것이다. EU는 러시아의 국익을 이해하는데 전혀 관심이 없다. 러시아는 지금부터 미국도 EU도 신뢰하지 않을 것"이라고 했다.#
미국 상무부에 따르면 러시아의 반도체 수입이 전쟁 전보다 90%까지 감소했다고 한다.#
</body>
</html>